app/controllers/clientes_controller.rb

  def index
    @clientes = Cliente.all
---
SELECT * FROM `clientes`

  def show
    @cliente = Cliente.find(params[:id])
---
SELECT * FROM `clientes` WHERE (`clientes`.`id` = 1)

  def edit
    @cliente = Cliente.find(params[:id])
---
SELECT * FROM "clientes" WHERE ("clientes"."id" = 2)

  def create
    @cliente = Cliente.new(params[:cliente])

    respond_to do |format|
      if @cliente.save
---
INSERT INTO `clientes` (`updated_at`, `telefone`, `created_at`, `nome`) VALUES('2013-01-11 15:06:11', 92631244, '2013-01-11 15:06:11', 'alexandre')

  def update
    @cliente = Cliente.find(params[:id])

    respond_to do |format|
      if @cliente.update_attributes(params[:cliente])
---
SELECT * FROM "clientes" WHERE ("clientes"."id" = 2)
UPDATE "clientes" SET "telefone" = 92631244, "updated_at" = '2013-01-10 18:16:42' WHERE "id" = 2